# ExecuteRules Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PerformanceAdviser..::..ExecuteRules Method
PerformanceAdviser Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExecuteRules(Document, IList<(Of <<'(PerformanceAdviserRuleId>)>>)) | Executes selected rules on a given document. |
| ExecuteRules(Document, IList<(Of <<'(Int32>)>>)) | Executes selected rules on a given document. |

# See Also
PerformanceAdviser Class
PerformanceAdviser Members
Autodesk.Revit.DB Namespace